In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
#READING FILE FROM CSV
auto_data = pd.read_csv('../Resources/adverts.csv')

In [3]:
# MAKING A COPY OF THE FILE AND ADDING AND TAKIN ONLY A SAMPLE OF IT
auto_dat_copy = auto_data.copy().sample(n=5000, ignore_index=True)
auto_dat_copy.shape

(5000, 12)

In [4]:
auto_dat_copy.isnull().sum()

public_reference           0
mileage                    0
reg_code                 383
standard_colour           87
standard_make              0
standard_model             0
vehicle_condition          0
year_of_registration     406
price                      0
body_type                 10
crossover_car_and_van      0
fuel_type                 10
dtype: int64

In [5]:
auto_dat_copy.head(5)

,public_reference,mileage,reg_code,standard_colour,standard_make,standard_model,vehicle_condition,year_of_registration,price,body_type,crossover_car_and_van,fuel_type
0,202009183892179,4406.0,66,Red,Vauxhall,Zafira Tourer,USED,2016.0,11290,MPV,False,Petrol
1,202008172594694,3000.0,70,Silver,Audi,Q5,USED,2020.0,36999,SUV,False,Diesel
2,202010074721237,19097.0,18,White,Volkswagen,Tiguan,USED,2018.0,17900,SUV,False,Petrol
3,202004048857620,3500.0,20,Black,Volkswagen,Polo,USED,2020.0,14699,Hatchback,False,Petrol
4,202010014452729,4245.0,19,Silver,Volvo,XC60,USED,2019.0,36750,SUV,False,Diesel Hybrid

In [6]:
f_col = auto_dat_copy.columns
for x in f_col:
    dc = auto_dat_copy[x]
    if auto_dat_copy[x].dtypes =='O':
        dc_m = dc.fillna(auto_dat_copy[x].mode().iloc[0])
    else:
        dc_m = dc.fillna(value = auto_dat_copy[x].mean())
    auto_dat_copy.update({x: dc_m})

In [7]:
auto_dat_copy.isnull().sum()

public_reference         0
mileage                  0
reg_code                 0
standard_colour          0
standard_make            0
standard_model           0
vehicle_condition        0
year_of_registration     0
price                    0
body_type                0
crossover_car_and_van    0
fuel_type                0
dtype: int64

In [8]:
auto_dat_copy.head(5)

,public_reference,mileage,reg_code,standard_colour,standard_make,standard_model,vehicle_condition,year_of_registration,price,body_type,crossover_car_and_van,fuel_type
0,202009183892179,4406.0,66,Red,Vauxhall,Zafira Tourer,USED,2016.0,11290,MPV,False,Petrol
1,202008172594694,3000.0,70,Silver,Audi,Q5,USED,2020.0,36999,SUV,False,Diesel
2,202010074721237,19097.0,18,White,Volkswagen,Tiguan,USED,2018.0,17900,SUV,False,Petrol
3,202004048857620,3500.0,20,Black,Volkswagen,Polo,USED,2020.0,14699,Hatchback,False,Petrol
4,202010014452729,4245.0,19,Silver,Volvo,XC60,USED,2019.0,36750,SUV,False,Diesel Hybrid

In [9]:
data_numeric = auto_dat_copy[['mileage', 'vehicle_condition', 'year_of_registration', 'price']]
data_numeric.head(5)

   mileage vehicle_condition  year_of_registration  price
0   4406.0              USED                2016.0  11290
1   3000.0              USED                2020.0  36999
2  19097.0              USED                2018.0  17900
3   3500.0              USED                2020.0  14699
4   4245.0              USED                2019.0  36750

In [10]:
for column in data_numeric.columns:
    print(data_numeric[column].value_counts())

0.0        182
10.0       169
50000.0     26
60000.0     26
5.0         24
          ...
49575.0      1
9533.0       1
18945.0      1
93887.0      1
38707.0      1
Name: mileage, Length: 3241, dtype: int64
USED    4628
NEW      372
Name: vehicle_condition, dtype: int64
2017.0000    875
2016.0000    578
2019.0000    474
2018.0000    467
2015.0899    406
2020.0000    369
2015.0000    364
2013.0000    253
2014.0000    246
2012.0000    199
2011.0000    152
2010.0000    119
2009.0000    106
2008.0000    102
2007.0000     87
2006.0000     59
2005.0000     44
2004.0000     29
2003.0000     21
2002.0000     11
2001.0000     11
1998.0000      5
2000.0000      4
1995.0000      3
1999.0000      3
1997.0000      2
1988.0000      1
1968.0000      1
1977.0000      1
1996.0000      1
1985.0000      1
1986.0000      1
1993.0000      1
1973.0000      1
1984.0000      1
1994.0000      1
1990.0000      1
Name: year_of_registration, dtype: int64
7995     34
6495     30
10995    29
8995     27
11995    27
         ..
16980     1
13575     1
50810     1
6493      1
28600     1
Name: price, Length: 2190, dtype: int64

In [11]:
from sklearn.preprocessing import OneHotEncoder

In [12]:
ohe = OneHotEncoder()

feature_transformed = ohe.fit_transform(data_numeric[["vehicle_condition"]]).toarray()
feature_labels = ohe.categories_[0]

In [13]:
feature_labels = np.array(feature_labels).ravel()

In [14]:
features_encoded = pd.DataFrame(feature_transformed, columns=feature_labels)
features_encoded.head(10)

   NEW  USED
0  0.0   1.0
1  0.0   1.0
2  0.0   1.0
3  0.0   1.0
4  0.0   1.0
5  0.0   1.0
6  0.0   1.0
7  0.0   1.0
8  0.0   1.0
9  1.0   0.0

In [15]:
data_numeric = pd.concat([data_numeric, features_encoded], axis=1)
data_numeric.tail(10)

      mileage vehicle_condition  year_of_registration  price  NEW  USED
4990  47544.0              USED                2011.0   5890  0.0   1.0
4991   8597.0              USED                2019.0  42950  0.0   1.0
4992   5150.0              USED                2019.0  25500  0.0   1.0
4993   9579.0              USED                2019.0  28600  0.0   1.0
4994    162.0              USED                2018.0  39990  0.0   1.0
4995  20778.0              USED                2018.0  18995  0.0   1.0
4996  63911.0              USED                2015.0  33995  0.0   1.0
4997  28600.0              USED                2017.0  11450  0.0   1.0
4998  27824.0              USED                2016.0  15800  0.0   1.0
4999  38707.0              USED                2015.0   9500  0.0   1.0

In [18]:
data_numeric

      mileage vehicle_condition  year_of_registration  price  NEW  USED
0      4406.0              USED                2016.0  11290  0.0   1.0
1      3000.0              USED                2020.0  36999  0.0   1.0
2     19097.0              USED                2018.0  17900  0.0   1.0
3      3500.0              USED                2020.0  14699  0.0   1.0
4      4245.0              USED                2019.0  36750  0.0   1.0
...       ...               ...                   ...    ...  ...   ...
4995  20778.0              USED                2018.0  18995  0.0   1.0
4996  63911.0              USED                2015.0  33995  0.0   1.0
4997  28600.0              USED                2017.0  11450  0.0   1.0
4998  27824.0              USED                2016.0  15800  0.0   1.0
4999  38707.0              USED                2015.0   9500  0.0   1.0

[5000 rows x 6 columns]

In [19]:
for column in data_numeric.columns:
    print(data_numeric[column].value_counts())

0.0        182
10.0       169
50000.0     26
60000.0     26
5.0         24
          ...
49575.0      1
9533.0       1
18945.0      1
93887.0      1
38707.0      1
Name: mileage, Length: 3241, dtype: int64
USED    4628
NEW      372
Name: vehicle_condition, dtype: int64
2017.0000    875
2016.0000    578
2019.0000    474
2018.0000    467
2015.0899    406
2020.0000    369
2015.0000    364
2013.0000    253
2014.0000    246
2012.0000    199
2011.0000    152
2010.0000    119
2009.0000    106
2008.0000    102
2007.0000     87
2006.0000     59
2005.0000     44
2004.0000     29
2003.0000     21
2002.0000     11
2001.0000     11
1998.0000      5
2000.0000      4
1995.0000      3
1999.0000      3
1997.0000      2
1988.0000      1
1968.0000      1
1977.0000      1
1996.0000      1
1985.0000      1
1986.0000      1
1993.0000      1
1973.0000      1
1984.0000      1
1994.0000      1
1990.0000      1
Name: year_of_registration, dtype: int64
7995     34
6495     30
10995    29
8995     27
11995    27
         ..
16980     1
13575     1
50810     1
6493      1
28600     1
Name: price, Length: 2190, dtype: int64
0.0    4628
1.0     372
Name: NEW, dtype: int64
1.0    4628
0.0     372
Name: USED, dtype: int64